Revit.Elements.LevelTraceData
This class acts as a representation of a Level constructor state, we can store it in trace
it's used to keep track of what the user wanted to set the name of the level to